app/Controllers/Login.php

    private function updateLoginStatus($userId, $status)
    {
        switch (session('role')) {
            case 'administrator':
                $this->user->update(['id_user' => $userId], ['status' => $status]);
---
UPDATE `tb_user` SET `status` = 'OFF'
WHERE `tb_user`.`id_user` IN ('7')