app/Models/ExamModel.php

    public function checkAndUpdateExamStatus()
    {
        $currentDate = date('Y-m-d');
        $currentTime = date('H:i:s');

        $builder = $this->db->table($this->table);

        $builder->where('status', 'publish');
        $builder->where("tgl_exam < '$currentDate' OR end_time < '$currentTime'");

        $builder->update(['status' => 'expired']);
---
UPDATE `tb_exam` SET `status` = 'expired'
WHERE `status` = 'publish'
AND `tgl_exam` < '2024-01-30' OR `end_time` < '22:23:55'